Repository: YahooArchive/Sparkle
Catalog: *.lproj/Sparkle.strings
Languages: ro

source: %1$@ %2$@ has been downloaded and is ready to use! Would you like to install it and relaunch %1$@ now?
ro: %1$@ %2$@ a fost descărcat și este gata de utilizare! Doriți să îl instalați și să-l relansați %1$@ acum?

source: %1$@ can't be updated when it's running from a read-only volume like a disk image or an optical drive. Move %1$@ to your Applications folder, relaunch it from there, and try again.
ro: %1$@ nu poate fii actualizată atunci când este pornită de pe un volum read-only ca o imagine disc sau o unitate optică. Mută %1$@ în directorul Applications, repornește-o de acolo și încearca din nou.

source: %@ %@ is currently the newest version available.
ro: %1$@ %2$@ este în prezent cea mai nouă versiune disponibilă.

source: %@ %@ is now available--you have %@. Would you like to download it now?
ro: %1$@ %2$@ este disponibilă—-tu ai %3$@. Doriți să o descărcați acum?

source: %@ downloaded
ro: %@ descărcat

source: %@ of %@
ro: %1$@ din %2$@

source: A new version of %@ is available!
ro: O nouă versiune %@ este disponibilă!

source: A new version of %@ is ready to install!
ro: O nouă versiune %@ este gata de instalare!

source: An error occurred in retrieving update information. Please try again later.
ro: O eroare a avut loc în preluarea informaţiilor de actualizare. Vă rugăm să reîncercaţi mai târziu.

source: An error occurred while downloading the update. Please try again later.
ro: A apărut o eroare la descărcarea actualizării. Vă rugăm să reîncercaţi mai târziu.

source: An error occurred while extracting the archive. Please try again later.
ro: O eroare a avut loc în timpul dezarhivării arhivei. Vă rugăm să reîncercaţi mai târziu.

source: An error occurred while installing the update. Please try again later.
ro: A apărut o eroare la instalarea actualizării. Vă rugăm să reîncercaţi mai târziu.

source: An error occurred while parsing the update feed.
ro: A apărut o eroare la citirea feed-ului de actualizare.

source: An error occurred while relaunching %1$@, but the new version will be available next time you run %1$@.
ro: O eroare a avut loc în timpul relansării aplicației %1$@, dar noua versiune va fii disponibilă data viitoare când vei executa %1$@.

source: Cancel
ro: Anula

source: Cancel Update
ro: Anulează actualizare

source: Checking for updates...
ro: Verifică pentru actualizări…

source: Downloading update...
ro: Descarcă actualizare…

source: Extracting update...
ro: Dezarhivează actualizare…

source: Install and Relaunch
ro: Instalează și Relansează

source: Installing update...
ro: Instalează actualizare…

source: Ready to Install
ro: Pregatit pentru instalare

source: Should %1$@ automatically check for updates? You can always check for updates manually from the %1$@ menu.
ro: Ar trebui ca %1$@ să caute automat pentru actualizări? Puteți verifica mereu de actualizări din meniul %1$@.

source: Update Error!
ro: Eroare actualizare!

source: Updating %@
ro: Actualizează %@

source: You already have the newest version of %@.
ro: Aveți cea mai nouă versiune de %@.

source: You're up-to-date!
ro: Ai ultima versiune!

source: Learn More...
ro: Află mai multe…
